Tekla Open API Reference for Tekla Structures 2025
Assembly.Insert Method
 Inserts the Assembly instance in the model. At the moment only rebar assemblies can be inserted. The main object of the assembly must be a Reinforcement or RebarSet. If the main rebar is not set (null), the main rebar will be automatically set to the secondary rebar with the biggest weight.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
True if successful; otherwise false.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace